# 'brew tap'
tap "homebrew/cask"

# Binaries
brew 'mackup'
brew 'mas'

# Development
brew 'figlet'
brew 'imagemagick'
brew 'nvm'
brew 'postgresql'
brew 'rbenv'
brew 'ruby-build'
brew 'tmux'
brew 'tmuxinator'

# Services
# services start postgresql

# Cask
cask 'discord'
cask 'dropbox'
cask 'google-chrome'
cask 'gpg-suite'
cask 'macvim'
cask 'insomnia'
cask 'iterm2'
cask 'raycast'
cask 'setapp'
cask 'snipy'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'the-unarchiver'
cask 'typora'
cask 'zoom'
# cask 'hiddenbar'
# cask 'marta'
# cask 'vuze'

# Mac App Store
mas '1Password 7', id: 1333542190
mas 'DevCleaner', id: 1388020431
mas 'Money Pro', id: 972572731
mas 'Numbers', id: 409203825
mas 'Save to Raindrop.io', id: 1549370672
mas 'Slack', id: 803453959
mas 'Spark', id: 1176895641
mas 'Telegram', id: 747648890
mas 'WhatsApp', id: 1147396723
mas 'Xcode', id: 497799835
