# 'brew tap'
tap "homebrew/cask"

# Binaries
brew 'mackup'
brew 'mas'

# Development
# brew 'figlet'
brew 'imagemagick'
brew 'postgresql'
brew 'tmux'

# zsh plugins
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
brew 'zsh-you-should-use'

# Services
# services start postgresql

# Cask
cask 'macvim'
cask 'wezterm'
cask 'raycast'
cask 'rectangle'

# Mac App Store
mas '1Password 7', id: 1333542190
mas 'DevCleaner', id: 1388020431
mas 'DevUtils.app', id: 1533756032
mas 'Slack', id: 803453959
mas 'Telegram', id: 747648890
mas 'WhatsApp', id: 1147396723
mas 'Xcode', id: 497799835
